git_server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Config Git Server</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-08 三"/>
<meta name="author" content="yannik"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Config Git Server</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Prepare </a></li>
<li><a href="#sec-2">2 Create Git Repo </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prepare </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Modify hostname
</li>
</ul>

<p>modify hostname in /etc/hostname to GitServer
</p><ul>
<li>
add a user and make a directory .ssh

</li>
</ul>


<pre class="example">$ sudo adduser git
$ su git
$ mkdir ~/.ssh
</pre>



<ul>
<li>
add member's ssh public key into ~/.ssh/authorized<sub>keys</sub>

</li>
</ul>


<pre class="example">$ cat id_rsa.bob.pub &gt;&gt; ~/.ssh/authorized_keys
$ cat id_rsa.jone.pub &gt;&gt; ~/.ssh/authorized_keys
</pre>




</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Create Git Repo </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
create a bare repo

</li>
</ul>


<pre class="example">$ cd ~/
$ mkdir project.git
$ cd project.git
$ git --bare init
</pre>




<ul>
<li>
create a git repo in work pc and push the code to remote git server

</li>
</ul>


<pre class="example">$ cd myproject
$ git init
$ git add .
$ git commit -m "initial commit"
$ git remote add origin git@GitServer:/home/git/project.git
$ git push origin master
</pre>




<ul>
<li>
Using it

</li>
</ul>


<pre class="example">$ git clone git@GitSerer:/home/git/project.git
$ git pull
$ git add .
$ git commit -m "add code"
$ git push origin master
</pre>



</div>
</div>
<div id="postamble">
<p class="author"> Author: yannik
<a href="mailto:yqli_520@hotmail.com">&lt;yqli_520@hotmail.com&gt;</a>
</p>
<p class="date"> Date: 2012-08-08 三</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
